# Data exploration

This serves only for exploration purposes, no real implementation or prediction here

In [5]:
import pandas as pd
import numpy as np

In [14]:
# Reading all the data

movies = pd.read_csv('./data/movies.csv', delimiter=';', dtype={'movieID':'int', 'year':'int', 'movie':'str'}, names=['movieID', 'year', 'movie'])
predictions = pd.read_csv('./data/predictions.csv', delimiter=';', names=['userID', 'movieID'], header=None)
ratings = pd.read_csv('./data/ratings.csv', delimiter=';', dtype={'userID':'int', 'movieID':'int', 'rating':'int'}, names=['userID', 'movieID', 'rating'])
user = pd.read_csv('./data/users.csv', delimiter=';', dtype={'userID':'int', 'gender':'str', 'age':'int', 'profession':'int'}, names=['userID', 'gender', 'age', 'profession'])

submission = pd.read_csv('./data/submission.csv')

## Movies

In [15]:
movies.head()

   movieID  year                               movie
0        1  1995                    Toy_Story_(1995)
1        2  1995                      Jumanji_(1995)
2        3  1995             Grumpier_Old_Men_(1995)
3        4  1995            Waiting_to_Exhale_(1995)
4        5  1995  Father_of_the_Bride_Part_II_(1995)

## Predictions

In [16]:
predictions.head()

   userID  movieID
0    1635     1914
1    2077     2124
2    3507     1582
3    1117     2857
4    5298     3281

## Ratings

In [17]:
ratings.head()

   userID  movieID  rating
0    5494     2006       4
1    3579     1143       3
2    1251     2567       2
3    5687      652       4
4    3018     3440       4

## Submission

In [18]:
submission.head()

   Id  Rating
0   1  3.5813
1   2  3.5813
2   3  3.5813
3   4  3.5813
4   5  3.5813

## Users

In [19]:
user.head()

   userID gender  age  profession
0       1      F    1          10
1       2      M   56          16
2       3      M   25          15
3       4      M   45           7
4       5      M   25          20